Функция СоздатьИлиОбновить(ПродажаСсылка) Экспорт
	
	// Проверяем есть ли уже абонемент по этой продаже
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Абонементы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Абонементы КАК Абонементы
	               |ГДЕ
	               |	Абонементы.ПродажаАбонемента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПродажаСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	// Если нет - создаем, если есть - получаем по ссылке
	Если РезультатЗапроса.Пустой() Тогда
		АбонементОбъект = Справочники.Абонементы.СоздатьЭлемент();
		АбонементОбъект.ПродажаАбонемента = ПродажаСсылка;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		АбонементОбъект = Выборка.Ссылка.ПолучитьОбъект();		
	КонецЕсли;
	
	// Заполняем или обновляем реквизиты 
	АбонементОбъект.Клиент = ПродажаСсылка.Клиент;
	АбонементОбъект.ВидАбонемента = ПродажаСсылка.ВидАбонемента;
	АбонементОбъект.Безлимитный = ПродажаСсылка.ВидАбонемента.Безлимитный;
	АбонементОбъект.КоличествоПосещений = ПродажаСсылка.ВидАбонемента.КоличествоПосещений;
	АбонементОбъект.ДатаНачала = ПродажаСсылка.ДатаНачала;
	АбонементОбъект.ДатаОкончания = ПродажаСсылка.ДатаНачала + ПродажаСсылка.ВидАбонемента.СрокДействияДней * 86400;
	АбонементОбъект.Записать();
	
	Возврат АбонементОбъект.Ссылка
КонецФункции

	