
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Создается или обновляется абонемент
	Абонемент = Справочники.Абонементы.СоздатьИлиОбновить(Ссылка);
	                             	
	// Если не безлимитный, нужно приходовать посещения
	Если Не ВидАбонемента.Безлимитный Тогда
		// Движения - регистр ОстаткиПосещений Приход
		Движения.ОстаткиПосещений.Записывать = Истина;
		Движение = Движения.ОстаткиПосещений.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Абонемент = Абонемент;
		Движение.Клиент = Клиент; 
		Движение.Период = Дата;
		Движение.Количество = ВидАбонемента.КоличествоПосещений;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = Дата;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОстаткиПосещений.Абонемент
	|ИЗ
	|	РегистрНакопления.ОстаткиПосещений КАК ОстаткиПосещений
	|ГДЕ
	|	ОстаткиПосещений.Абонемент.ПродажаАбонемента = &Продажа 
	|   И ОстаткиПосещений.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
	Запрос.УстановитьПараметр("Продажа", Ссылка);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;
		Сообщить("Нельзя распровести документ - по абонементу уже были списания");
	КонецЕсли;
	
КонецПроцедуры 

