
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Создается или обновляется абонемент
	Абонемент = Справочники.Абонементы.СоздатьИлиОбновить(Ссылка);
	                             	
	// Если не безлимитный, нужно приходовать посещения
	Если Не ВидАбонемента.Безлимитный Тогда
		// Движения - регистр ОстаткиПосещений Приход
		Движения.ОстаткиПосещений.Записывать = Истина;
		Движение = Движения.ОстаткиПосещений.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Абонемент = Абонемент;
		Движение.Клиент = Клиент; 
		Движение.Период = Дата;
		Движение.Количество = ВидАбонемента.КоличествоПосещений;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = Дата;
	КонецЕсли;
КонецПроцедуры
