
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаАбонемента") Тогда
		Клиент = ДанныеЗаполнения.Клиент;
		Сумма = ДанныеЗаполнения.Сумма;
		Основание = ДанныеЗаполнения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОказаниеУслуги") Тогда
		Клиент = ДанныеЗаполнения.Клиент;
		Основание = ДанныеЗаполнения;
		
		Сумма = 0;
		Для Каждого ТекСтрокаУслуги ИЗ ДанныеЗаполнения.Услуги Цикл
			Если ТекСтрокаУслуги.СпособРасчета = Перечисления.СпособыРасчета.Разово Тогда
				Сумма = Сумма + ТекСтрокаУслуги.Сумма;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Не ЗначениеЗаполнено(Основание) Тогда
		Отказ = Истина;
		Сообщить("Не заполнено основание оплаты");
		Возврат;
	КонецЕсли;
	
	Движения.Продажи.Записывать = Истина;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПродажаАбонемента") Тогда
		Если Сумма <> Основание.Сумма Тогда
			Отказ = Истина;
			Сообщить("Сумма оплаты (" + Сумма + ") не совпадает с суммой документа основания (" + Основание.Сумма + ")");
			Возврат;
		КонецЕсли;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.ВидАбонемента = Основание.ВидАбонемента;
		Движение.Сумма = Сумма;
		Движение.Количество = 1; 
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОказаниеУслуги") Тогда
		
		СуммаОснования = 0;
		Для Каждого ТекСтрокаУслуги Из Основание.Услуги Цикл
			Если ТекСтрокаУслуги.СпособРасчета = Перечисления.СпособыРасчета.Разово Тогда
				СуммаОснования = СуммаОснования + ТекСтрокаУслуги.Сумма;
			КонецЕсли;
		КонецЦикла;
		
		Если Сумма <> СуммаОснования Тогда
			Отказ = Истина;
			Сообщить("Сумма оплаты (" + Сумма + ") не совпадает с суммой документа основания (" + СуммаОснования + ")");
			Возврат;
		КонецЕсли;
		
		Для Каждого ТекСтрокаУслуги Из Основание.Услуги Цикл
			Если ТекСтрокаУслуги.СпособРасчета <> Перечисления.СпособыРасчета.Разово Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата;
			Движение.Клиент = Клиент;
			Движение.Услуга = ТекСтрокаУслуги.Услуга;
			Движение.Сумма = ТекСтрокаУслуги.Сумма;
			Движение.Количество = ТекСтрокаУслуги.Количество;
		КонецЦикла;
		
	КонецЕсли;
	
				

КонецПроцедуры
