
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Запрет проведения пустого документа (без услуг)
	Если Услуги.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщить("Документ не содержит ни одной услуги");
		Возврат;
	КонецЕсли;
	
	АбонементыДляСписания = Новый Массив;
	НомерСтроки = 0;
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		НомерСтроки = НомерСтроки + 1;
		ТипУслуги = ТекСтрокаУслуги.Услуга.ТипУслуги;
		// Проверка необходимости указания тренера
		Если ТипУслуги = Перечисления.ТипыУслуг.ГрупповаяТренировка ИЛИ ТипУслуги = Перечисления.ТипыУслуг.ПерсональнаяТренировка Тогда
			Если Не ЗначениеЗаполнено(Тренер) Тогда
				Отказ = Истина;
				Сообщить("Строка " + НомерСтроки + " - выбрана услуга, требующая указания тренера");
			КонецЕсли;
		КонецЕсли;
		
		// Разовый расчет - списывать остатки абонемента не нужно
		Если ТекСтрокаУслуги.СпособРасчета = Перечисления.СпособыРасчета.Разово Тогда
			Продолжить;
		КонецЕсли;
		
		Абонемент = ТекСтрокаУслуги.Абонемент;
		Если Не ЗначениеЗаполнено(Абонемент) Тогда
			Отказ = Истина;
			Сообщить("Строка " + НомерСтроки + " - не указан абонемент");
			Продолжить;
		КонецЕсли;
		
		
		Если Абонемент.ДатаОкончания < НачалоДня(ДатаОказания) Тогда
			Отказ = Истина;
			Сообщить("Строка " + НомерСтроки + " - срок действия абонемента истек");
			Продолжить;
		КонецЕсли;
		
		ЗонаУслуги = ТекСтрокаУслуги.Услуга.ЗонаКлуба;
		Если ЗначениеЗаполнено(ЗонаУслуги) И Абонемент.ВидАбонемента.ДоступныеЗоныКлуба.Найти(ЗонаУслуги) = Неопределено Тогда
			Отказ = Истина;
			Сообщить("Строка " + НомерСтроки + " - услуга не входит в данный абонемент");
		КонецЕсли;
		
		Если Абонемент.Безлимитный Тогда
			Продолжить;
		КонецЕсли;
		
		Если АбонементыДляСписания.Найти(Абонемент) = Неопределено Тогда
			АбонементыДляСписания.Добавить(Абонемент);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//Проверка остатков 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиПосещенийОстатки.Абонемент КАК Абонемент,
	|	ОстаткиПосещенийОстатки.КоличествоОстаток КАК КоличествоОстаток	
	|ИЗ
	|	РегистрНакопления.ОстаткиПосещений.Остатки(&МоментВремени, Абонемент В (&СписокАбонементов)) КАК ОстаткиПосещенийОстатки";
	Запрос.УстановитьПараметр("МоментВремени", КонецДня(ДатаОказания));
	Запрос.УстановитьПараметр("СписокАбонементов", АбонементыДляСписания);
	
	ОстаткиПоАбонементам = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОстаткиПоАбонементам.Вставить(Выборка.Абонемент, Выборка.КоличествоОстаток);
	КонецЦикла;
	
	Для Каждого Абонемент ИЗ АбонементыДляСписания Цикл
		Остатки = ОстаткиПоАбонементам.Получить(Абонемент);
		Если Остатки = Неопределено Тогда
			Остатки = 0;
		КонецЕсли;
		Если Остатки < 1 Тогда
			Отказ = Истина;
			Сообщить("Не хватает посещений по абонементу " + Строка(Абонемент));
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//Движения по регистру ОстаткиПосещений
	Движения.ОстаткиПосещений.Записывать = Истина;
	Для Каждого Абонемент Из АбонементыДляСписания Цикл
		
		Движение = Движения.ОстаткиПосещений.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ДатаОказания;
		Движение.Клиент = Клиент;
		Движение.Абонемент = Абонемент;
		Движение.Количество = 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаписьНаЗанятие") Тогда
		Клиент = ДанныеЗаполнения.Клиент;
		Тренер = ДанныеЗаполнения.Тренер;
		ДатаОказания = ДанныеЗаполнения.ДатаЗанятия;
		
		СтрокаУслуги = Услуги.Добавить();
		СтрокаУслуги.Услуга = ДанныеЗаполнения.Услуга;
		СтрокаУслуги.Количество = 1;
	КонецЕсли;
	
КонецПроцедуры
