
&НаКлиенте
Процедура ВидАбонементаПриИзменении(Элемент)
	ПодставитьЦену();
КонецПроцедуры

&НаКлиенте
Процедура ПодставитьЦену()
	
	Если Не ЗначениеЗаполнено(Объект.ВидАбонемента) Тогда
		Возврат;
	КонецЕсли;
	
	Цена = ПолучитьЦенуАбонемента(Объект.ВидАбонемента, Объект.Дата);
	Если Цена <> Неопределено Тогда
		Объект.Сумма = Цена;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "На дату " + Объект.Дата + 
		" цена для абонемента не установлена - введите сумму вручную.";
		Сообщение.Поле = "Сумма";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуАбонемента(ВидАбонементаСсылка, ДатаПокупки)
	  Запрос = Новый Запрос("ВЫБРАТЬ ЦеныАбонементов.Цена
	  | ИЗ РегистрСведений.ЦеныАбонементов.СрезПоследних(&ДатаПокупки, ВидАбонемента = &ВидАбонемента) КАК ЦеныАбонементов");
	  Запрос.УстановитьПараметр("ВидАбонемента", ВидАбонементаСсылка);
	  Запрос.УстановитьПараметр("ДатаПокупки", ДатаПокупки);
	  
	  Выборка = Запрос.Выполнить().Выбрать();
	  Если Выборка.Следующий() Тогда
		  Возврат Выборка.Цена;
	  КонецЕсли;
	  Возврат Неопределено;
	  
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаНачала = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры
	  
	  
	
	