
Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	Если  ИменаПараметровСеанса = Неопределено Или ИменаПараметровСеанса.Найти("ТекущийТренер") <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Тренеры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Тренеры КАК Тренеры
		|ГДЕ
		|	Тренеры.ИмяПользователя = &ИмяПользователя";
		Запрос.УстановитьПараметр("ИмяПользователя", ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ПараметрыСеанса.ТекущийТренер = Выборка.Ссылка;
		Иначе
			ПараметрыСеанса.ТекущийТренер = Справочники.Тренеры.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
