
&НаКлиенте
Процедура УслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Количество = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
          ПодставитьЦенуИСумму(Элементы.Услуги.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
		ПересчитатьСуммуСтроки(Элементы.Услуги.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
		ПересчитатьСуммуСтроки(Элементы.Услуги.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УслугиСпособРасчетаПриИзменении(Элемент)
	ОбновитьПоСпособуРасчета(Элементы.Услуги.ТекущаяСтрока);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая()И Не ЗначениеЗаполнено(Объект.ДатаОказания) Тогда
		Объект.ДатаОказания = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры 


&НаСервере
Процедура ПодставитьЦенуИСумму(НомерСтроки)
	СтрокаУслуги = Объект.Услуги[НомерСтроки];
	
	Если Не ЗначениеЗаполнено(СтрокаУслуги.Услуга) Тогда
		Возврат;
	КонецЕсли;
	
	Цена = ПолучитьЦенуУслуги(СтрокаУслуги.Услуга, Объект.ДатаОказания);
	Если Цена = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "На дату " + Объект.Дата + 
		" цена услуги не установлена - введите цену вручную.";
		Сообщение.Поле = "Цена";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;  
	
	СтрокаУслуги.Цена = Цена;
	СтрокаУслуги.Сумма = Цена * СтрокаУслуги.Количество;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуСтроки(НомерСтроки)
	СтрокаУслуги = Объект.Услуги[НомерСтроки];
	СтрокаУслуги.Сумма = СтрокаУслуги.Цена * СтрокаУслуги.Количество;
КонецПроцедуры	

&НаСервере
Процедура ОбновитьПоСпособуРасчета(НомерСтроки)
	СтрокаУслуги = Объект.Услуги[НомерСтроки];
	
	Если СтрокаУслуги.СпособРасчета = Перечисления.СпособыРасчета.Разово Тогда
		ПодставитьЦенуИСумму(НомерСтроки);
		СтрокаУслуги.Абонемент = Справочники.Абонементы.ПустаяСсылка();
	Иначе
		СтрокаУслуги.Цена = 0;
		СтрокаУслуги.Сумма = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуУслуги(УслугаСсылка, ДатаОказания)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ЦеныУслуг.Цена КАК Цена 
	|ИЗ
	|	РегистрСведений.ЦеныУслуг.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныУслуг";
	Запрос.УстановитьПараметр("Дата", ДатаОказания);
	Запрос.УстановитьПараметр("Услуга", УслугаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции



